Desafios/blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("book_title", "book_author", "note", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "book_author" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["book_author", "J.K Rowling"], ["updated_at", "2023-05-29 10:33:12.503623"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)